app/controllers/inventories_controller.rb

SELECT * FROM `inventories`
---
  def index
    @inventories = Inventory.all

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
---
  def show
    @inventory = Inventory.find(params[:id])

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
---
  def edit
    @inventory = Inventory.find(params[:id])

INSERT INTO `inventories` (`name`, `updated_at`, `code`, `description`, `inventory_type_id`, `user_id`, `address`, `created_at`) VALUES('Kho ', '2010-04-02 10:16:26', 'KNL-001', 'Kho chứa nguyên liệu số 1', NULL, NULL, 'Long Xuyên, An Giang', '2010-04-02 10:16:26')
---
  def create
    @inventory = Inventory.new(params[:inventory])

    respond_to do |format|
      if @inventory.save

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
UPDATE `inventories` SET `updated_at` = '2010-04-02 10:20:45', `name` = 'Kho Nguyên Liệu 01' WHERE `id` = 1
---
  def update
    @inventory = Inventory.find(params[:id])

    respond_to do |format|
      if @inventory.update_attributes(params[:inventory])