app/controllers/material_exchanges_controller.rb

  def index
    @material_exchanges = MaterialExchange.all
---
SELECT * FROM `material_exchanges`

  def show
    @material_exchange = MaterialExchange.find(params[:id])
---
SELECT * FROM `material_exchanges` WHERE (`material_exchanges`.`id` = 1)

  def create
    @material_exchange = MaterialExchange.new(params[:material_exchange])

    respond_to do |format|
      if @material_exchange.save
        # Input to inventory
        inventory = InventoryDetail.find(:first, :conditions => ["storage_id = ? and inventory_id = ?",
                                                                  @material_exchange.material_id,
                                                                  @material_exchange.inventory_id])
        inventory = InventoryDetail.new if inventory.nil?
        inventory.inventory_id = @material_exchange.inventory_id
        inventory.storage_type = 0
        inventory.storage_id = @material_exchange.material_id
        inventory.size = 0 if inventory.size.nil?
        inventory.size = @material_exchange.exchange_type == 0 ?
                         inventory.size + @material_exchange.size :
                         inventory.size - @material_exchange.size
        inventory.save
---
INSERT INTO `material_exchanges` (`inventory_id`, `material_id`, `size`, `updated_at`, `created_by`, `type`, `weight_unit_id`, `created_date`, `description`, `reason`, `created_at`) VALUES(1, 1, 10, '2010-04-02 11:47:07', 1, NULL, 1, '2010-04-02 11:46:21', '', 'Nhập hàng', '2010-04-02 11:47:07')
SELECT * FROM `inventory_details` WHERE (storage_id = 1 and inventory_id = 1) LIMIT 1
INSERT INTO `inventory_details` (`inventory_id`, `storage_type`, `size`, `updated_at`, `storage_id`, `description`, `created_at`) VALUES(1, 0, NULL, '2010-04-02 13:22:06', 3, NULL, '2010-04-02 13:22:06')
UPDATE `inventory_details` SET `inventory_id` = 2, `updated_at` = '2010-04-02 14:10:48', `size` = 210 WHERE `id` = 13