app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT * FROM `materials`

  def show
    @material = Material.find(params[:id])
    @inventory_details = InventoryDetail.find(:all, :conditions => ["storage_type = 0 and storage_id = ?", @material.id])
    @exchange_details = MaterialExchange.find(:all, :conditions => ["material_id = ?", @material.id],
                                                    :order => "created_at DESC")
---
SELECT * FROM `materials` WHERE (`materials`.`id` = 1)
SELECT * FROM `inventory_details` WHERE (storage_type = 0 and storage_id = 1)
SELECT * FROM `material_exchanges` WHERE (material_id = 1) ORDER BY created_at DESC

  def edit
    @material = Material.find(params[:id])
---
SELECT * FROM `materials` WHERE (`materials`.`id` = 1)

  def create
    @material = Material.new(params[:material])

    respond_to do |format|
      if @material.save
---
INSERT INTO `materials` (`name`, `updated_at`, `material_type_id`, `code`, `description`, `created_at`) VALUES('Khóm loại 1', '2010-04-02 10:24:49', NULL, 'NLK-001', 'Nguyên liệu Khóm \r\nLoại 1', '2010-04-02 10:24:49')

  def update
    @material = Material.find(params[:id])

    respond_to do |format|
      if @material.update_attributes(params[:material])
---
SELECT * FROM `materials` WHERE (`materials`.`id` = 1)
UPDATE `materials` SET `description` = 'Nguyên liệu Khóm Loại 1', `updated_at` = '2010-04-02 10:27:30' WHERE `id` = 1