app/controllers/semi_products_controller.rb

SELECT * FROM `semi_products`
---
  def index
    @semi_products = SemiProduct.all