app/controllers/semi_product_exchanges_controller.rb

SELECT * FROM `semi_product_exchanges`
---
  def index
    @semi_product_exchanges = SemiProductExchange.all