app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `hash_password`, `is_blocked`, `updated_at`, `username`, `fullname`, `is_admin`, `position_id`, `sex`, `description`, `address`, `email`, `can_not_delete`, `mobile_phone`, `created_at`) VALUES('873757800.988633739123109', 'a95a5cac00b770f3931e6622efb5412a9786bd9a', 0, '2010-04-02 08:59:07', 'administrator', 'PIS Administrator', 1, NULL, 1, '', '', 'pis.simplify@gmail.com', 0, '0919007807', '2010-04-02 08:59:07')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save