app/controllers/weight_units_controller.rb

  def index
    @weight_units = WeightUnit.all
---
SELECT * FROM `weight_units`

  def show
    @weight_unit = WeightUnit.find(params[:id])
---
SELECT * FROM `weight_units` WHERE (`weight_units`.`id` = 1)

  def create
    @weight_unit = WeightUnit.new(params[:weight_unit])

    respond_to do |format|
      if @weight_unit.save
---
INSERT INTO `weight_units` (`name`, `updated_at`, `description`, `created_at`) VALUES('kg', '2010-04-02 11:19:28', '', '2010-04-02 11:19:28')